ana002_buoyantPimple_circleTempRoughMesh_001/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

15
(
    maintankInlet_vol_2-4_0
    {
        type            patch;
        nFaces          1284;
        startFace       828694;
    }
    topSlip_slip_2-4_3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16811;
        startFace       829978;
    }
    underWall_wall_2-4_3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9924;
        startFace       846789;
    }
    tempOutlet_vol_3-6_0
    {
        type            patch;
        nFaces          324;
        startFace       856713;
    }
    floodOutlet_press_2-4_0
    {
        type            patch;
        nFaces          544;
        startFace       857037;
    }
    pumpOutlet_vol_2-4_0
    {
        type            patch;
        nFaces          544;
        startFace       857581;
    }
    tempInlet_vol_3-6_0
    {
        type            patch;
        nFaces          324;
        startFace       858125;
    }
    mainWall_wall_2-4_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2590;
        startFace       858449;
    }
    floodinWallhate_wall_2-4_3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1440;
        startFace       861039;
    }
    floodWal_wall_2-4_3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3180;
        startFace       862479;
    }
    pumpinWallheat_wall_2-4_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1440;
        startFace       865659;
    }
    tempoutWal_wall_3-6_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5036;
        startFace       867099;
    }
    pumpWall_wall_2-4_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3180;
        startFace       872135;
    }
    model_other_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          19414;
        startFace       875315;
    }
    tempInWall_wall_3-6_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5036;
        startFace       894729;
    }
)

// ************************************************************************* //
