ana002_buoyantPimple_circleTempRoughMesh_001/constant/outletWeightAreaTempFile
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    constant;
    object      outletWeightAreaTempFile;
}
TinMainTank     299.518;
Time     1000;
