ana002_buoyantPimple_circleTempRoughMesh_001/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

// thermoType
// {
//     type            heRhoThermo;
//     mixture         pureMixture;
//     transport       const;
//     thermo          hConst;
//     equationOfState perfectGas;
//     specie          specie;
//     energy          sensibleEnthalpy;
// }

// pRef            100000;

mixture                                                                                                                                                                                                                           
{                                                                                                                                                                                                                                 
    specie                                                                                                                                                                                                                        
    {                                                                                                                                                                                                                             
        molWeight       18;                                                                                                                                                                                                    
    }                                                                                                                                                                                                                             
    thermodynamics                                                                                                                                                                                                                
    {                                                                                                                                                                                                                             
        Cp              4200;                                                                                                                                                                                                   
        Hf              0;                                                                                                                                                                                                        
    }                                                                                                                                                                                                                             
    transport                                                                                                                                                                                                                     
    {                                                                                                                                                                                                                             
        mu              1.0e-03;                                                                                                                                                                                                
        Pr              7.0;                                                                                                                                                                                                    
    } 
    equationOfState                                                                                                                                                                                                               
    {                                                                                                                                                                                                                             
        rho     1000;                                                                                                                                                                                                             
    }                                                                                                                                                                                                                             
}
// mixture
// {
//     specie
//     {
//         molWeight       28.9;
//     }
//     thermodynamics
//     {
//         Cp              1000;
//         Hf              0;
//     }
//     transport
//     {
//         mu              1.8e-05;
//         Pr              0.7;
//     }
// }


// ************************************************************************* //
