ana002_buoyantPimple_circleTempRoughMesh_001/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ".*"
    {
        type            noSlip;
    }

    maintankInlet_vol_2-4_0
    {
        type flowRateInletVelocity;
        volumetricFlowRate constant 0.00183333333; //[m3/s]
    }

    tempInlet_vol_3-6_0
    {
        type flowRateInletVelocity;
        volumetricFlowRate constant 4.166666666666667e-4; //[m3/s]
    }

    pumpOutlet_vol_2-4_0
    {
        type flowRateOutletVelocity;
        volumetricFlowRate constant 0.0011666666666667; //[m3/s]
    }
    floodOutlet_press_2-4_0
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }
    tempOutlet_vol_3-6_0
    {
        type flowRateOutletVelocity;
        volumetricFlowRate constant 4.166666666666667e-4; //[m3/s]
    }
    topSlip_slip_2-4_3
    {
        type            slip;
    }

    pumpinWallheat_wall_2-4_0
    {
        type noSlip;
    }
    floodinWallhate_wall_2-4_3
    {
        type noSlip;
    }
}


// ************************************************************************* //
