ana002_buoyantPimple_circleTempRoughMesh_001/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    ".*"
    {
        type fixedFluxPressure;
        value $internalField;
    }

    maintankInlet_vol_2-4_0
    {
        type fixedFluxPressure;
        value $internalField;
    }

    tempInlet_vol_3-6_0
    {
        type fixedFluxPressure;
        value $internalField;
    }

    pumpOutlet_vol_2-4_0
    {
        type fixedFluxPressure;
        value $internalField;
    }
    floodOutlet_press_2-4_0
    {
        type totalPressure;
        p0 $internalField;

        value $internalField;
    }
    tempOutlet_vol_3-6_0
    {
        type fixedFluxPressure;
        value $internalField;
    }
    topSlip_slip_2-4_3
    {
        type slip;
   }

    pumpinWallheat_wall_2-4_0
    {
        type fixedFluxPressure;
        value $internalField;
    }
    floodinWallhate_wall_2-4_3
    {
        type fixedFluxPressure;
        value $internalField;
    }
}


// ************************************************************************* //
