ana002_buoyantPimple_circleTempRoughMesh_001/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    //https://doc.openfoam.com/2306/tools/processing/boundary-conditions/rtm/derived/thermal/externalWallHeatFluxTemperature/
    ".*"
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;

        h           uniform 10;
        Ta          $internalField;

        qr          none;//on;                      // 放射も有効に
        emissivity  0.9;                     // 面の放射率 0–1
        kappaMethod     fluidThermo;
        value       $internalField;
    }

    maintankInlet_vol_2-4_0
	{
		// type    fixedValue;
		// value    uniform 302;//298.15;
		type            codedFixedValue;
		name            externalSyncFixedValue2;
		value           $internalField;
		code
		#{
			// pythonSyncファイルをobjectRegistryへ登録（初回のみ）
			if(!db().foundObject<IOdictionary>("outletWeightAreaTempFile"))
			{
				autoPtr<IOdictionary> externalSyncPtr1
				(
					new IOdictionary
					(
						IOobject
						(
							"outletWeightAreaTempFile",
							db().time().constant(),
							db(),
							IOobject::MUST_READ,
							IOobject::NO_WRITE
						)
					)
				);
				db().store<IOdictionary>(externalSyncPtr1);
			}

			// objectRegistry上のpythonSyncを呼び出す
			IOdictionary& externalSync1 = db().lookupObjectRef<IOdictionary>("outletWeightAreaTempFile");
			// 内容の更新
			externalSync1.regIOobject::read();
			// pythonSyncファイルからUColdSyncの値を取得
			const scalar& TinMainTank = externalSync1.get<scalar>("TinMainTank");
			// fixedValueの値を渡す
			operator==(TinMainTank);
		#};
	}

    
    tempInlet_vol_3-6_0
    {
        type fixedValue;
        value $internalField;//
    }

    pumpOutlet_vol_2-4_0
    {
        type zeroGradient;
    }
    floodOutlet_press_2-4_0
    {
        type zeroGradient;
    }
    tempOutlet_vol_3-6_0
    {
        type zeroGradient;
    }
    topSlip_slip_2-4_3
    {
        // type            slip;
        type            externalWallHeatFluxTemperature;
        mode            coefficient;

        h           uniform 10;
        Ta          $internalField;

        qr          none;//on;                      // 放射も有効に
        emissivity  0.9;                     // 面の放射率 0–1
        kappaMethod     fluidThermo;
        value       $internalField;
    }

    pumpinWallheat_wall_2-4_0
    {
        type            externalWallHeatFluxTemperature;
        mode            power;

        Q               uniform 1200;      // 壁全体で 500 W を与える
        kappaMethod     fluidThermo;      // 熱伝導率を流体側から取得
        value           $internalField;      // 初期温度（適当な値でOK）
    }
    floodinWallhate_wall_2-4_3
    {
        type            externalWallHeatFluxTemperature;
        mode            power;

        Q               uniform 1000;      // 壁全体で 500 W を与える
        kappaMethod     fluidThermo;      // 熱伝導率を流体側から取得
        value           $internalField;      // 初期温度（適当な値でOK）
    }
}


// ************************************************************************* //
