ana002_buoyantPimple_circleTempRoughMesh_001/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    ".*"
    {
		type    omegaWallFunction;
		//blending    binomial2;
		value    uniform 6.7082e-05;
    }

    maintankInlet_vol_2-4_0
    {
		type    turbulentMixingLengthFrequencyInlet;
		mixingLength    0.01;
		value    uniform 0.67082;
    }

    tempInlet_vol_3-6_0
    {
		type    turbulentMixingLengthFrequencyInlet;
		mixingLength    0.01;
		value    uniform 0.67082;
    }

    pumpOutlet_vol_2-4_0
    {
		type    inletOutlet;
		inletValue    uniform 0.67082;
		value    uniform 6.7082e-05;
    }
    floodOutlet_press_2-4_0
    {
		type    inletOutlet;
		inletValue    uniform 0.67082;
		value    uniform 6.7082e-05;
    }
    tempOutlet_vol_3-6_0
    {
		type    inletOutlet;
		inletValue    uniform 0.67082;
		value    uniform 6.7082e-05;
    }
    topSlip_slip_2-4_3
    {
        type            slip;
    }

    pumpinWallheat_wall_2-4_0
    {
		type    omegaWallFunction;
		//blending    binomial2;
		value    uniform 6.7082e-05;
    }
    floodinWallhate_wall_2-4_3
    {
		type    omegaWallFunction;
		//blending    binomial2;
		value    uniform 6.7082e-05;
    }
}


// ************************************************************************* //
