ana002_buoyantPimple_circleTempRoughMesh_001/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    maintankInlet_vol_2-4_0
    {
        type            calculated;
        value           uniform 0;
    }
    topSlip_slip_2-4_3
    {
        type            calculated;
        value           uniform 0;
    }
    underWall_wall_2-4_3
    {
        type            calculated;
        value           uniform 0;
    }
    tempOutlet_vol_3-6_0
    {
        type            calculated;
        value           uniform 0;
    }
    floodOutlet_press_2-4_0
    {
        type            calculated;
        value           uniform 0;
    }
    pumpOutlet_vol_2-4_0
    {
        type            calculated;
        value           uniform 0;
    }
    tempInlet_vol_3-6_0
    {
        type            calculated;
        value           uniform 0;
    }
    mainWall_wall_2-4_0
    {
        type            calculated;
        value           uniform 0;
    }
    floodinWallhate_wall_2-4_3
    {
        type            calculated;
        value           uniform 0;
    }
    floodWal_wall_2-4_3
    {
        type            calculated;
        value           uniform 0;
    }
    pumpinWallheat_wall_2-4_0
    {
        type            calculated;
        value           uniform 0;
    }
    tempoutWal_wall_3-6_0
    {
        type            calculated;
        value           uniform 0;
    }
    pumpWall_wall_2-4_0
    {
        type            calculated;
        value           uniform 0;
    }
    model_other_wall
    {
        type            calculated;
        value           uniform 0;
    }
    tempInWall_wall_3-6_0
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
