ana002_buoyantPimple_circleTempRoughMesh_001/system/continuityErrorVolDict
  FoamFile
{
	version    2.0;
	format    ascii;
	class     dictionary;
	object    continuityErrorVolDict;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  continuityError1
  {
    type continuityError;
    libs
      (
        fieldFunctionObjects
      ); 	// Mandatory entries (unmodifiable)// Optional entries (runtime modifiable)
    phi phi; 	// Optional (inherited) entries
    writePrecision 8;
    writeToFile yes;
    useUserTime yes;
    region region0;
    enabled yes;
    log yes;
    timeStart 0;
    timeEnd 6000;
    executeControl timeStep;
    executeInterval 1;
    writeControl timeStep;
    writeInterval 50;
  }
  // residuals
  // {
  //   type solverInfo;
  //   libs
  //     (
  //       "libutilityFunctionObjects.so"
  //     );
  //   fields
  //     (
  //       ".*"
  //     );
  // }
  // fieldMinMax1
  // {
  //   type fieldMinMax;
  //   libs
  //     (
  //       fieldFunctionObjects
  //     ); 	// Mandatory entries (unmodifiable)// Mandatory entries (runtime modifiable)
  //   mode magnitude;
  //   fields
  //     (
  //       U
  //       p
  //     ); 	// Optional entries (runtime modifiable)
  //   location yes;
  //   writePrecision 8;
  //   writeToFile yes;
  //   useUserTime yes;
  //   region region0;
  //   enabled yes;
  //   log yes;
  //   timeStart 0;
  //   timeEnd 8000;
  //   executeControl timeStep;
  //   executeInterval 1;
  //   writeControl timeStep;
  //   writeInterval 100;
  // }
  topSlip_slip_2-4_3
  {
    type surfaceFieldValue;
    libs
      (
        "libfieldFunctionObjects.so"
      );
    writeControl timeStep;
    log yes;
    writeFields no;
    regionType patch;
    name topSlip_slip_2-4_3;
    operation sum;
    fields
      (
        phi
      ); 	// Optional (inherited) entries
    writePrecision 8;
    writeToFile yes;
    useUserTime yes;
    region region0;
    enabled yes;
    timeStart 0;
    timeEnd 8000;
    executeControl timeStep;
    executeInterval 1;
    writeInterval 100;
  }

  pumpOutlet_vol_2-4_0
  {
    $topSlip_slip_2-4_3;
    name pumpOutlet_vol_2-4_0;
  }

  floodOutlet_press_2-4_0
  {
    $topSlip_slip_2-4_3;
    name floodOutlet_press_2-4_0;
  }

  tempOutlet_vol_3-6_0
  {
    $topSlip_slip_2-4_3;
    name tempOutlet_vol_3-6_0;
  }

  tempInlet_vol_3-6_0
  {
    $topSlip_slip_2-4_3;
    name tempInlet_vol_3-6_0;
  }
  maintankInlet_vol_2-4_0
  {
    $topSlip_slip_2-4_3;
    name maintankInlet_vol_2-4_0;
  }
  