ana002_buoyantPimple_circleTempRoughMesh_001/system/inletOutletTemp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
// \*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      inletOutletTemp;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
  
functions
{
    surfaceFieldValue_mainInlet_vol_2-4_0
    {
        type    surfaceFieldValue;
        libs    ("libfieldFunctionObjects.so");
        region    region0;
        log    yes;
        writeControl    writeTime;
        writeFields    yes;
        regionType    patch;
        name    maintankInlet_vol_2-4_0;
        operation    weightedAreaAverage;
        weightField    phi;
        fields    ( T );

        // // ★ NEW：v2412では必須
        surfaceFormat   none;//   csv;
    }
    surfaceFieldValue_pumpOutlet_vol_2-4_0
    {
        $surfaceFieldValue_mainInlet_vol_2-4_0
        name            pumpOutlet_vol_2-4_0;
    }
    surfaceFieldValue_floodOutlet_press_2-4_0
    {
        $surfaceFieldValue_mainInlet_vol_2-4_0
        name            floodOutlet_press_2-4_0;
    }
    surfaceFieldValue_tempOutlet_vol_3-6_0
    {
        $surfaceFieldValue_mainInlet_vol_2-4_0
        name            tempOutlet_vol_3-6_0;
    }
    surfaceFieldValue_tempInlet_vol_3-6_0
    {
        $surfaceFieldValue_mainInlet_vol_2-4_0
        name            tempInlet_vol_3-6_0;
    }
}