ana002_buoyantPimple_circleTempRoughMesh_001/system/probes
probes
{
    // Where to load it from
    libs            (sampling);
    type            probes;
 
    // Name of the directory for probe data
    name            probes;
 
    // Write at same frequency as fields
    executeControl timeStep;
    executeInterval 1;
    writeControl timeStep;
    writeInterval 1;
 
    // Fields to be probed
    fields
    (
        p U T
    );
 
    //高さ50mmの場所
    probeLocations
    (
        (  0.15  0.1  0.05 ) //probe0
        (  0.25  0.15 0.05 ) //probe1
        (  0.35  0.15 0.05 ) //probe2
        (  0.15  0.45 0.05 ) //probe3
        (  0.25  0.45 0.05 ) //probe4
        (  0.35  0.45 0.05 ) //probe5
        (  0.15  0.75 0.05 ) //probe6
        (  0.25  0.75 0.05 ) //probe7
        (  0.35  0.75 0.05 ) //probe8
    );
}